docs/bellman_ford.html
<!doctype html>
<html lang="en">
<head>
<title>Algoritmo di Bellman Ford</title>
<!-- 2022-05-10 Tue 09:43 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Pietro Visconti">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Algoritmi preliminari</a></li>
<li><a href="#sec-2">2. Algoritmo</a></li>
<li><a href="#sec-3">3. Complessità</a></li>
<li><a href="#sec-4">4. Dimostrazione della correttezza</a></li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Algoritmo di Bellman Ford</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Algoritmi preliminari</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #a89984;">/*</span>
<span style="color: #a89984;">G = grafo</span>
<span style="color: #a89984;">s = nodo sorgente</span>
<span style="color: #a89984;">*/</span>
<span style="color: #b57614;">INIT_SS</span><span style="color: #076678;">(</span>G, s<span style="color: #076678;">){</span>
    <span style="color: #9d0006;">for</span> each u in V<span style="color: #b16286;">[</span>G<span style="color: #b16286;">]{</span>
        d<span style="color: #8ec07c;">[</span>u<span style="color: #8ec07c;">]</span> = +inf
        &#960;<span style="color: #8ec07c;">[</span>u<span style="color: #8ec07c;">]</span> = <span style="color: #8f3f71;">NIL</span>
    <span style="color: #b16286;">}</span>
    d<span style="color: #b16286;">[</span>s<span style="color: #b16286;">]</span> = <span style="color: #8f3f71; font-weight: bold;">0</span>
<span style="color: #076678;">}</span>

<span style="color: #a89984;">/*</span>
<span style="color: #a89984;">v = nodo di arrivo</span>
<span style="color: #a89984;">u = nodo precedente a v (?)</span>
<span style="color: #a89984;">w(u, v) = peso dell'arco tra u e v</span>
<span style="color: #a89984;">*/</span>
<span style="color: #b57614;">RELAX</span><span style="color: #076678;">(</span>u, v, w<span style="color: #b16286;">(</span>u, v<span style="color: #b16286;">)</span><span style="color: #076678;">){</span>
    <span style="color: #9d0006;">if</span><span style="color: #b16286;">(</span>d<span style="color: #8ec07c;">[</span>v<span style="color: #8ec07c;">]</span> &gt; d<span style="color: #8ec07c;">[</span>u<span style="color: #8ec07c;">]</span> + w<span style="color: #8ec07c;">(</span>u, v<span style="color: #8ec07c;">)</span><span style="color: #b16286;">){</span>
        d<span style="color: #8ec07c;">[</span>v<span style="color: #8ec07c;">]</span> = d<span style="color: #8ec07c;">[</span>u<span style="color: #8ec07c;">]</span> + w<span style="color: #8ec07c;">(</span>u, v<span style="color: #8ec07c;">)</span>
        &#960;<span style="color: #8ec07c;">[</span>v<span style="color: #8ec07c;">]</span> = u
    <span style="color: #b16286;">}</span>
<span style="color: #076678;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Algoritmo</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #a89984;">/*</span>
<span style="color: #a89984;">G = grafo</span>
<span style="color: #a89984;">w = funzione peso</span>
<span style="color: #a89984;">s = nodo sorgente</span>

<span style="color: #a89984;">PREREQUISITI: supporta pesi negativi ma non cicli negativi.</span>
<span style="color: #a89984;">*/</span>
<span style="color: #8f3f71;">BELLMAN</span>-<span style="color: #8f3f71;">FORD</span><span style="color: #076678;">(</span>G, w, s<span style="color: #076678;">){</span>
    <span style="color: #a89984;">//</span><span style="color: #a89984;">INIZIALIZZAZIONE</span>
    <span style="color: #8f3f71;">INIT_SS</span><span style="color: #b16286;">(</span>G, s<span style="color: #b16286;">)</span>

    <span style="color: #a89984;">//</span><span style="color: #a89984;">RELAX SU TUTTI I NODI (TRANNE LA SORGENTE)</span>
    <span style="color: #9d0006;">for</span> i = <span style="color: #8f3f71; font-weight: bold;">1</span> TO |V<span style="color: #b16286;">[</span>G<span style="color: #b16286;">]</span>| - <span style="color: #8f3f71; font-weight: bold;">1</span><span style="color: #b16286;">{</span>
        <span style="color: #9d0006;">for</span> each <span style="color: #8ec07c;">(</span>u, v<span style="color: #8ec07c;">)</span> <span style="color: #8f3f71;">in</span> <span style="color: #076678;">E</span><span style="color: #8ec07c;">[</span>G<span style="color: #8ec07c;">]{</span>
            <span style="color: #8f3f71;">RELAX</span><span style="color: #d65d0e;">(</span>u, v, <span style="color: #076678;">(</span>u, v<span style="color: #076678;">)</span><span style="color: #d65d0e;">)</span>
        <span style="color: #8ec07c;">}</span>
    <span style="color: #b16286;">}</span>

    <span style="color: #a89984;">//</span><span style="color: #a89984;">VERIFICA CHE NON CI SIANO CICLI NEGATIVI</span>
    <span style="color: #9d0006;">for</span> each <span style="color: #b16286;">(</span>u, v<span style="color: #b16286;">)</span> <span style="color: #8f3f71;">in</span> <span style="color: #076678;">E</span><span style="color: #b16286;">[</span>G<span style="color: #b16286;">]{</span>
        <span style="color: #9d0006;">if</span><span style="color: #8ec07c;">(</span>d<span style="color: #d65d0e;">[</span>v<span style="color: #d65d0e;">]</span> &gt; d<span style="color: #d65d0e;">[</span>u<span style="color: #d65d0e;">]</span> + w<span style="color: #d65d0e;">(</span>u, v<span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">){</span>
            <span style="color: #9d0006;">return</span> <span style="color: #d65d0e;">(</span><span style="color: #8f3f71;">FALSE</span>, d, &#960;<span style="color: #d65d0e;">)</span>
        <span style="color: #8ec07c;">}</span>
    <span style="color: #b16286;">}</span>

    <span style="color: #9d0006;">return</span> <span style="color: #b16286;">(</span><span style="color: #8f3f71;">TRUE</span>, d, &#960;<span style="color: #b16286;">)</span>
<span style="color: #076678;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Complessità</h2>
<div class="outline-text-2" id="text-3">
<blockquote>
<p>
n (inizializzazione) + (n - 1)m (for della relax) + m (controllo cicli negativi)
<br>
-&gt; <font color="red"> O(n*m)</font>
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Dimostrazione della correttezza</h2>
<div class="outline-text-2" id="text-4">
<blockquote>
<p>
<font color="red"> Teorema di correttezza di Bellman-Ford</font>
<br>
Si esegua l&rsquo;algoritmo di Bellman-Ford su un grafo G = (V, E).
<br>
W : E -&gt; R con vertice sorgente s ∈ V.
<br>
Se in G <b>non ci sono cicli negativi raggiungibili da s</b>, allora alla fine dell&rsquo;esecuzione di BF:
<br>
</p>
<ol class="org-ol">
<li>d[u] = δ(s, u)
</li>
<li>Gπ è albero di cammini minimi
</li>
<li>L&rsquo;algoritmo restituisce TRUE
</li>
</ol>
<p>
<br>
Se invece in G esiste un ciclo negativo raggiungibile da s, allora l&rsquo;algoritmo restituisce FALSE.
<br>
<br>
<font color="red"> Dimostrazione</font>
<br>
<b>Ipotesi</b> : Esiste ciclo negativo raggiungibile da s.
<br>
<b>Tesi</b> : L&rsquo;algoritmo restituisce FALSE.
<br>
<b>PER ASSURDO</b> : L&rsquo;algoritmo restituisce TRUE.
<br>
<br>
∀ (u, v) ∈ E : d[v] &lt;= d[u] + w(u, v)
<br>
C = &lt;X<sub>0</sub>, X<sub>1</sub>, &#x2026; X<sub>Q</sub>&gt; raggiungibili da s
<br>
X<sub>0</sub> = X<sub>Q</sub>
<br>
[Sommatoria che va da i = 1 a Q]: w(X<sub>(i-1)</sub>, X<sub>i</sub>) &lt; 0
<br>
∀ i = 1 &#x2026; Q
<br>
d[X<sub>i</sub>] &lt;= d[X<sub>(i-1)</sub>] + w(X<sub>(i-1)</sub>, X<sub>i</sub>)
</p>
</blockquote>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Pietro Visconti</p>
<p class="date">Created: 2022-05-10 Tue 09:43</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 28.0.91 (<a href="http://orgmode.org">Org-mode</a> 9.6)</p>
</div>
</footer>
</body>
</html>
